# Знакомство с языком Python (семинары)
# Урок 8. Работа с файлами
# https://gb.ru/lessons/391159/homework

'''

Задача №49. 
Решение в группах

Создать телефонный справочник с
возможностью импорта и экспорта данных в формате .txt. 
Данные, которые должны находиться в файле:
Фамилия, имя, отчество, номер телефона. 

1. Программа должна выводить данные
2. Программа должна сохранять данные в текстовом файле
3. Пользователь может ввести одну из характеристик 
для поиска определенной записи (Например имя или фамилию человека)
4. Использование функций. Ваша программа не должна быть линейной.
'''

# Иванов, Иван, 111, описание Иванова
# Петров,	Петр,	222,	описание Петрова
# Васичкина, Василиса, 333, описание Васичкиной
# Питонов, Антон, 777, умеет в Питон

"""
ДЗ по задаче из 01(С-08)

Дополнить телефонный справочник возможностью изменения и удаления данных.
Пользователь также может ввести имя или фамилию, 
и Вы должны реализовать функционал для изменения и удаления данных.
"""

# 01:02:30, семинар-8 (см. lesson08.py)
'''
Решение (Сергей Сердюк) - начало, требует завершения.

Функция "Вход/Выход" 
(дополнение), с кодом не конектится.
'''
def work_out():
	cache = input('Продолжить?\n1-да,\n2-нет\n: ')
	if cache == '1': 
		work_with_phonebook() # функция меню выбора действий (см. внизу)
	elif cache == '2':
		print('Пока!')
		exit() # это вшитая фукция Pyhton?
	else: 
		print('Введена не верная команда')
		work_out()

'''
Функция записи, хранения и поиска данных телефоных номеров
work_with_phonebook '''

def work_with_phonebook():

    choice = show_menu() 
    
    phone_book = read_txt('phonebook.txt')

    while (choice != 8): 

        if choice == 1:
            print_result(phone_book) 
        elif choice == 2:
            last_name = input('lastname ')
            print(find_by_lastname(phone_book, last_name))
        elif choice == 3:
            last_name = input('lastname ')  # Зачем вводить фамилию, 
                                            # когда поиск идёт по номеру?
            new_number = input('new number ')
            print(change_number(phone_book, last_name, new_number))
        elif choice == 4:
            last_name = input('lastname ') 
            print(delete_by_lastname(phone_book, last_name))
        elif choice == 5:
            new_number = input('new number ')
            print(find_by_number(phone_book, number))
        elif choice == 6:
            user_data = input('new data ')
            add_user(phone_book, user_data)
            write_txt('phonebook.txt', phone_book)
        elif choice == 7: 
             work_out()
            
            # print(phone_book) # прямой возврат в меню работы с телефонной книгой
                                         # или данное действие нужно совершать через функцию?
            
                                                      
        choice = show_menu()



''' Функция show_menu '''

def show_menu():
    print("\nВыберите нeобходимое действие:\n"
          "1. Отобразить весь справочник\n"
          "2. Найти обонента по фамилии\n"
          "3. найти обонента по номеру телефона\n"
          "4. Добавить абонента в справочник\n"
          "5. Изменить данные\n"
          "6. Сохранить справочник в текстовом формате\n"
          "7. Закончить работу\n")
    choice = int(input("Введи номер пкнкта: ")) 
    return choice


""" 
Таблица данных (пример)

Таблица в программе (?) должна представлять из себя список кортежей:
[(фамилия, Иванов), (имя, Иван), (телефон, 111), (описание, друг)]

P.S.
Таблица хранения данных телефонной книги 
размещается в отдельный текстовый файл 'phonebook.txt',
где будет хранится список номеров и данные пользователей.

Файл 'phonebook.txt':
"""
# Иванов, Иван, 111, описание Иванова
# Петров,	Петр,	222,	описание Петрова
# Васичкина, Василиса, 333, описание Васичкиной
# Питонов, Антон, 777, умеет в Питон

# surname = 'Фамилия'
# name = 'Имя'
# phone = 'Телефон' 
# portrait = 'Описание'




''' Функция чтения - read_txt'''

def read_txt(filename):
    phone_book = []
    fields = ["Фамилия", "Имя", "Телефон", "Описание"] # шапка таблицы данных

    with open(filename, 'r', encoding = 'utf-8') as phb: 

        for line in phb: # 'line' - строка таблицы, перебираемая в данных
            record = dict(zip(fields, line.split(','))) # список словарей для телефонной книги
            dict(( (фамилия, Иванов), (имя, Точка), (номер, 8-928) )) # <- словари: (ключ, значение)
                                                                     # 1 строка - 1 человек
        phone_book.append(record) # список данных человека (словари)
    return phone_book # возврат списка



''' Функция записи - write_txt'''

def write_txt(filename, phone_book): 
    
    with open(filename, 'w', encoding = 'utf-8') as phout:  
        for i in range(len(phone_book)):
            s = ''
            for v in phone_book[i].values(): 
                s += v + ','
            phout.write(f'{s[:-1]}\n')  


work_with_phonebook()
